Tekla Open API Reference for Tekla Structures 2025
PluginPropertyFileLocationAttribute Class
Used to specify file location for a property file.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.PluginPropertyFileLocationAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class PluginPropertyFileLocationAttribute : Attribute
Public NotInheritable Class PluginPropertyFileLocationAttribute
	Inherits Attribute
The PluginPropertyFileLocationAttribute type exposes the following members.
Constructors
Name | Description
PluginPropertyFileLocationAttribute
Initializes a new instance of the PluginPropertyFileLocationAttribute class, for a file with provided filename suffix.
Top
Properties
Name | Description
Subdirectory
Gets the property file subdirectory in a model folder.
Suffix
Gets the property file suffix.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace